99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
#include "esp32_mquickjs_http.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_HTTP

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_http_client_resources.h"
#include "esp32_mquickjs_http_operation_resources.h"
#include "esp32_mquickjs_options.h"
#include "utils/esp32_mquickjs_request_response.h"
#include "esp32_mquickjs_stream.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <ctype.h>
#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
#include "esp_crt_bundle.h"
#endif
#include "esp_heap_caps.h"
#include "esp_http_client.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#define ESP32_MQUICKJS_HTTP_MAX_REQUEST_HEADERS 16
#define ESP32_MQUICKJS_HTTP_MAX_RESPONSE_HEADERS 16
#define ESP32_MQUICKJS_HTTP_USER_AGENT "esp32qjs/1.0"

struct esp32_mquickjs_http_operation {
    esp32_mquickjs_http_operation_resources_t resources;
    SemaphoreHandle_t lock;
    esp_http_client_handle_t client;
    bool cancel_requested;
};

static void *http_operation_resource_allocate(size_t size, void *opaque)
{
    (void)opaque;
    return heap_caps_calloc(1, size, MALLOC_CAP_8BIT);
}

static void http_operation_resource_release(void *value, void *opaque)
{
    (void)opaque;
    heap_caps_free(value);
}

static void *http_operation_resource_create_lock(void *opaque)
{
    (void)opaque;
    return xSemaphoreCreateMutex();
}

static void http_operation_resource_delete_lock(void *lock, void *opaque)
{
    (void)opaque;
    vSemaphoreDelete((SemaphoreHandle_t)lock);
}

static const esp32_mquickjs_http_operation_resource_ops_t
    s_http_operation_resource_ops = {
        .allocate = http_operation_resource_allocate,
        .release = http_operation_resource_release,
        .create_lock = http_operation_resource_create_lock,
        .delete_lock = http_operation_resource_delete_lock,
    };

static int http_client_resource_cleanup(void *client, void *opaque)
{
    (void)opaque;
    return esp_http_client_cleanup((esp_http_client_handle_t)client);
}

static const esp32_mquickjs_http_client_resource_ops_t
    s_http_client_resource_ops = {
        .cleanup = http_client_resource_cleanup,
    };

static esp_err_t http_operation_cleanup_client(
    esp32_mquickjs_http_operation_t *operation,
    esp_http_client_handle_t client);

typedef struct {
    esp32_mquickjs_http_response_t *response;
    size_t body_len;
    size_t body_cap;
    size_t max_body_bytes;
    esp_err_t error;
    bool body_limit_exceeded;
    bool drop_headers;
} esp32_mquickjs_http_capture_t;

static void http_operation_lock(esp32_mquickjs_http_operation_t *operation)
{
    if (operation != NULL && operation->lock != NULL) {
        xSemaphoreTake(operation->lock, portMAX_DELAY);
    }
}

static void http_operation_unlock(esp32_mquickjs_http_operation_t *operation)
{
    if (operation != NULL && operation->lock != NULL) {
        xSemaphoreGive(operation->lock);
    }
}

esp32_mquickjs_http_operation_t *esp32_mquickjs_http_operation_create(void)
{
    esp32_mquickjs_http_operation_resources_t resources;
    esp32_mquickjs_http_operation_t *operation;

    if (!esp32_mquickjs_http_operation_resources_init(
            &resources, &s_http_operation_resource_ops,
            sizeof(*operation))) {
        return NULL;
    }
    operation = resources.operation;
    operation->resources = resources;
    operation->lock = resources.lock;
    return operation;
}

bool esp32_mquickjs_http_operation_destroy(esp32_mquickjs_http_operation_t *operation)
{
    esp32_mquickjs_http_operation_resources_t resources;
    esp_err_t err;

    if (operation == NULL) {
        return true;
    }
    err = http_operation_cleanup_client(operation, operation->client);
    if (err != ESP_OK) {
        return false;
    }
    resources = operation->resources;
    esp32_mquickjs_http_operation_resources_deinit(
        &resources, &s_http_operation_resource_ops);
    return true;
}

bool esp32_mquickjs_http_operation_cancel(esp32_mquickjs_http_operation_t *operation)
{
    bool changed;

    if (operation == NULL) {
        return false;
    }
    http_operation_lock(operation);
    changed = !operation->cancel_requested;
    operation->cancel_requested = true;
    if (operation->client != NULL) {
        (void)esp_http_client_cancel_request(operation->client);
    }
    http_operation_unlock(operation);
    return changed;
}

bool esp32_mquickjs_http_operation_is_cancelled(esp32_mquickjs_http_operation_t *operation)
{
    bool cancelled;

    if (operation == NULL) {
        return false;
    }
    http_operation_lock(operation);
    cancelled = operation->cancel_requested;
    http_operation_unlock(operation);
    return cancelled;
}

static bool http_operation_attach_client(esp32_mquickjs_http_operation_t *operation,
                                         esp_http_client_handle_t client)
{
    bool attached = true;

    if (operation == NULL) {
        return true;
    }
    http_operation_lock(operation);
    operation->client = client;
    if (operation->cancel_requested) {
        attached = false;
    }
    http_operation_unlock(operation);
    return attached;
}

static esp_err_t http_operation_cleanup_client(
    esp32_mquickjs_http_operation_t *operation,
    esp_http_client_handle_t client)
{
    esp32_mquickjs_http_client_resources_t resources;
    esp_err_t err;

    if (client == NULL) {
        return ESP_OK;
    }
    if (operation == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    http_operation_lock(operation);
    if (operation->client != client) {
        http_operation_unlock(operation);
        return ESP_ERR_INVALID_STATE;
    }
    resources = (esp32_mquickjs_http_client_resources_t){
        .client = operation->client,
    };
    err = esp32_mquickjs_http_client_resources_deinit(
        &resources, &s_http_client_resource_ops);
    operation->client = (esp_http_client_handle_t)resources.client;
    http_operation_unlock(operation);
    return err;
}

static void http_operation_record_client_cleanup(
    esp32_mquickjs_http_operation_t *operation,
    esp_http_client_handle_t client,
    esp_err_t *out_err,
    char *error_text,
    size_t error_text_size)
{
    esp_err_t cleanup_err =
        http_operation_cleanup_client(operation, client);

    if (cleanup_err != ESP_OK) {
        *out_err = cleanup_err;
        snprintf(error_text, error_text_size,
                 "esp_http_client_cleanup() failed: %s",
                 esp_err_to_name(cleanup_err));
    }
}

