99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
char *esp32_mquickjs_http_strdup(const char *value)
{
    size_t len;
    char *copy;

    if (value == NULL) {
        return NULL;
    }

    len = strlen(value);
    copy = heap_caps_malloc(len + 1, MALLOC_CAP_8BIT);
    if (copy == NULL) {
        return NULL;
    }

    memcpy(copy, value, len + 1);
    return copy;
}

void esp32_mquickjs_http_free_headers(esp32_mquickjs_http_header_t *headers, size_t header_count)
{
    size_t i;

    if (headers == NULL) {
        return;
    }

    for (i = 0; i < header_count; ++i) {
        heap_caps_free(headers[i].key);
        heap_caps_free(headers[i].value);
    }
    heap_caps_free(headers);
}

void esp32_mquickjs_http_free_request(esp32_mquickjs_http_request_t *request)
{
    if (request == NULL) {
        return;
    }

    heap_caps_free(request->url);
    heap_caps_free(request->method);
    esp32_mquickjs_memory_payload_free(request->body);
    esp32_mquickjs_http_free_headers(request->headers, request->header_count);
    memset(request, 0, sizeof(*request));
}

void esp32_mquickjs_http_free_response(esp32_mquickjs_http_response_t *response)
{
    if (response == NULL) {
        return;
    }

    heap_caps_free(response->url);
    heap_caps_free(response->status_text);
    esp32_mquickjs_memory_payload_free(response->body);
    esp32_mquickjs_http_free_headers(response->headers, response->header_count);
    heap_caps_free(response);
}

static const char *http_status_text(int32_t status)
{
    switch (status) {
    case 200:
        return "OK";
    case 201:
        return "Created";
    case 202:
        return "Accepted";
    case 204:
        return "No Content";
    case 301:
        return "Moved Permanently";
    case 302:
        return "Found";
    case 304:
        return "Not Modified";
    case 307:
        return "Temporary Redirect";
    case 308:
        return "Permanent Redirect";
    case 400:
        return "Bad Request";
    case 401:
        return "Unauthorized";
    case 403:
        return "Forbidden";
    case 404:
        return "Not Found";
    case 405:
        return "Method Not Allowed";
    case 408:
        return "Request Timeout";
    case 409:
        return "Conflict";
    case 413:
        return "Payload Too Large";
    case 429:
        return "Too Many Requests";
    case 500:
        return "Internal Server Error";
    case 502:
        return "Bad Gateway";
    case 503:
        return "Service Unavailable";
    case 504:
        return "Gateway Timeout";
    default:
        return "";
    }
}

static bool http_method_from_string(const char *method, esp_http_client_method_t *out_method)
{
    struct {
        const char *name;
        esp_http_client_method_t method;
    } methods[] = {
        { "GET", HTTP_METHOD_GET },
        { "POST", HTTP_METHOD_POST },
        { "PUT", HTTP_METHOD_PUT },
        { "PATCH", HTTP_METHOD_PATCH },
        { "DELETE", HTTP_METHOD_DELETE },
        { "HEAD", HTTP_METHOD_HEAD },
        { "OPTIONS", HTTP_METHOD_OPTIONS },
    };
    size_t i;

    if (method == NULL || out_method == NULL) {
        return false;
    }

    for (i = 0; i < sizeof(methods) / sizeof(methods[0]); ++i) {
        if (strcasecmp(method, methods[i].name) == 0) {
            *out_method = methods[i].method;
            return true;
        }
    }

    return false;
}

static bool http_request_has_header(const esp32_mquickjs_http_request_t *request, const char *name)
{
    size_t i;

    if (request == NULL || name == NULL) {
        return false;
    }
    for (i = 0; i < request->header_count; ++i) {
        if (request->headers[i].key != NULL && strcasecmp(request->headers[i].key, name) == 0) {
            return true;
        }
    }
    return false;
}

static int http_materialize_stream_body(JSContext *ctx,
                                        JSValue stream_value,
                                        const char *api_name,
                                        esp32_mquickjs_http_request_t *request)
{
    esp32_mquickjs_fs_stream_ref_t ref;
    uint8_t *body = NULL;
    size_t body_len = 0;
    bool binary;
    int result;

    if (!esp32_mquickjs_fs_parse_stream_ref(ctx, stream_value, &ref)) {
        return -1;
    }
    binary = esp32_mquickjs_stream_is_binary(&ref);
    result = esp32_mquickjs_stream_read_all_bytes(
        ctx, stream_value, api_name,
        CONFIG_ESP32_MQUICKJS_HTTP_MAX_REQUEST_BODY_BYTES,
        &body, &body_len);
    if (esp32_mquickjs_stream_close_value(ctx, stream_value) != ESP_OK &&
        result == 0) {
        esp32_mquickjs_memory_payload_free(body);
        JS_ThrowInternalError(ctx, "%s failed while closing the body stream",
                              api_name);
        return -1;
    }
    if (result != 0) {
        return -1;
    }

    request->body = body;
    request->body_len = body_len;
    request->body_present = true;
    request->body_binary = binary;
    return 0;
}

static int http_materialize_body(JSContext *ctx,
                                 JSValue body_value,
                                 const char *api_name,
                                 esp32_mquickjs_http_request_t *request)
{
    int class_id;

    if (JS_IsUndefined(body_value) || JS_IsNull(body_value)) {
        return 0;
    }
    if (JS_IsString(ctx, body_value)) {
        JSCStringBuf body_buf;
        const char *body;
        size_t body_len = 0;

        body = JS_ToCStringLen(ctx, &body_len, body_value, &body_buf);
        if (body == NULL) {
            return -1;
        }
        if (body_len > CONFIG_ESP32_MQUICKJS_HTTP_MAX_REQUEST_BODY_BYTES) {
            JS_ThrowRangeError(ctx, "%s exceeds the HTTP request body limit",
                               api_name);
            return -1;
        }
        if (body_len > 0) {
            request->body = esp32_mquickjs_memory_payload_alloc(
                "http.body", body_len, ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (request->body == NULL) {
                JS_ThrowOutOfMemory(ctx);
                return -1;
            }
            memcpy(request->body, body, body_len);
        }
        request->body_len = body_len;
        request->body_present = true;
        request->body_binary = false;
        return 0;
    }
    if (esp32_mquickjs_stream_is_stream(ctx, body_value)) {
        return http_materialize_stream_body(ctx, body_value, api_name, request);
    }

