99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
    class_id = JS_GetClassID(ctx, body_value);
    if (class_id == JS_CLASS_BYTE_VIEW) {
        esp32_mquickjs_byte_source_t source = {0};
        uint8_t *converted = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_byte_source(ctx, body_value, api_name,
                                            &source, &converted, &error)) {
            return -1;
        }
        if (source.length >
            CONFIG_ESP32_MQUICKJS_HTTP_MAX_REQUEST_BODY_BYTES) {
            esp32_mquickjs_release_byte_source(converted);
            JS_ThrowRangeError(ctx, "%s exceeds the HTTP request body limit",
                               api_name);
            return -1;
        }
        if (source.length > 0) {
            request->body = esp32_mquickjs_memory_payload_alloc(
                "http.body", source.length,
                ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (request->body == NULL) {
                esp32_mquickjs_release_byte_source(converted);
                JS_ThrowOutOfMemory(ctx);
                return -1;
            }
            memcpy(request->body, source.data, source.length);
        }
        request->body_len = source.length;
        request->body_present = true;
        request->body_binary = true;
        esp32_mquickjs_release_byte_source(converted);
        return 0;
    }
    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        JSGCRef global_ref;
        JSGCRef stream_ref;
        JSValue *global = JS_PushGCRef(ctx, &global_ref);
        JSValue *stream = JS_PushGCRef(ctx, &stream_ref);
        int result;

        *global = JS_GetGlobalObject(ctx);
        *stream = JS_IsException(*global)
                      ? JS_EXCEPTION
                      : esp32_mquickjs_stream_open_byte_source(
                            ctx, *global, body_value);
        if (JS_IsException(*stream)) {
            JS_PopGCRef(ctx, &stream_ref);
            JS_PopGCRef(ctx, &global_ref);
            return -1;
        }
        result = http_materialize_stream_body(ctx, *stream, api_name, request);
        JS_PopGCRef(ctx, &stream_ref);
        JS_PopGCRef(ctx, &global_ref);
        return result;
    }

    JS_ThrowTypeError(
        ctx,
        "%s expects a string, Stream, ByteView, or ByteSpanSource",
        api_name);
    return -1;
}

static int http_validate_content_length(JSContext *ctx,
                                        const esp32_mquickjs_http_request_t *request)
{
    size_t i;

    for (i = 0; i < request->header_count; ++i) {
        const char *value;
        const char *cursor;
        char *end = NULL;
        unsigned long long parsed;
        size_t actual = request->body_present ? request->body_len : 0;

        if (request->headers[i].key == NULL ||
            strcasecmp(request->headers[i].key, "Content-Length") != 0) {
            continue;
        }
        value = request->headers[i].value;
        cursor = value != NULL ? value : "";
        while (isspace((unsigned char)*cursor)) {
            cursor++;
        }
        errno = 0;
        parsed = strtoull(cursor, &end, 10);
        while (end != NULL && isspace((unsigned char)*end)) {
            end++;
        }
        if (cursor[0] == '\0' || cursor[0] == '-' || errno != 0 ||
            end == cursor || end == NULL || *end != '\0' ||
            parsed > SIZE_MAX) {
            JS_ThrowTypeError(ctx,
                              "Content-Length must be a non-negative integer");
            return -1;
        }
        if ((size_t)parsed != actual) {
            JS_ThrowRangeError(
                ctx,
                "Content-Length (%llu) does not match the request body (%u bytes)",
                parsed, (unsigned)actual);
            return -1;
        }
    }
    return 0;
}

static esp_err_t http_capture_append_body(esp32_mquickjs_http_capture_t *capture,
                                          const char *data,
                                          size_t data_len)
{
    static const size_t growth_step = 1024;
    size_t needed_cap;
    uint8_t *body;

    if (capture == NULL || capture->response == NULL || data == NULL || data_len == 0) {
        return ESP_OK;
    }

    if (data_len > capture->max_body_bytes ||
        capture->body_len > capture->max_body_bytes - data_len) {
        capture->body_limit_exceeded = true;
        return ESP_ERR_INVALID_SIZE;
    }

    needed_cap = capture->body_len + data_len;
    if (capture->body_cap < needed_cap) {
        size_t new_cap = needed_cap;

        if (new_cap < growth_step) {
            new_cap = growth_step;
        } else {
            new_cap = ((new_cap + growth_step - 1) / growth_step) * growth_step;
        }
        if (new_cap > capture->max_body_bytes) {
            new_cap = capture->max_body_bytes;
        }

        body = esp32_mquickjs_memory_payload_realloc(
            "http.body", capture->response->body,
            new_cap,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (body == NULL) {
            return ESP_ERR_NO_MEM;
        }
        capture->response->body = body;
        capture->body_cap = new_cap;
    }

    memcpy(capture->response->body + capture->body_len, data, data_len);
    capture->body_len += data_len;
    capture->response->body_len = capture->body_len;

    return ESP_OK;
}

static esp_err_t http_capture_add_header(esp32_mquickjs_http_capture_t *capture,
                                         const char *key,
                                         const char *value)
{
    esp32_mquickjs_http_header_t *header;

    if (capture == NULL || capture->response == NULL || key == NULL || value == NULL) {
        return ESP_OK;
    }
    if (capture->drop_headers) {
        return ESP_OK;
    }
    if (capture->response->header_count >= ESP32_MQUICKJS_HTTP_MAX_RESPONSE_HEADERS) {
        capture->drop_headers = true;
        return ESP_OK;
    }

    if (capture->response->headers == NULL) {
        capture->response->headers = heap_caps_calloc(ESP32_MQUICKJS_HTTP_MAX_RESPONSE_HEADERS,
                                                      sizeof(*capture->response->headers),
                                                      MALLOC_CAP_8BIT);
        if (capture->response->headers == NULL) {
            capture->drop_headers = true;
            return ESP_OK;
        }
    }

    header = &capture->response->headers[capture->response->header_count++];
    header->key = esp32_mquickjs_http_strdup(key);
    header->value = esp32_mquickjs_http_strdup(value);
    if (header->key == NULL || header->value == NULL) {
        heap_caps_free(header->key);
        heap_caps_free(header->value);
        header->key = NULL;
        header->value = NULL;
        capture->response->header_count--;
        capture->drop_headers = true;
        return ESP_OK;
    }

    return ESP_OK;
}

static esp_err_t http_event_handler(esp_http_client_event_t *evt)
{
    esp32_mquickjs_http_capture_t *capture;

