99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
    if (evt == NULL) {
        return ESP_OK;
    }
    capture = evt->user_data;
    if (capture == NULL) {
        return ESP_OK;
    }
    if (capture->error != ESP_OK) {
        return capture->error;
    }

    switch (evt->event_id) {
    case HTTP_EVENT_ON_HEADER:
        capture->error = http_capture_add_header(capture, evt->header_key, evt->header_value);
        break;
    case HTTP_EVENT_ON_DATA:
        capture->error = http_capture_append_body(capture, evt->data, (size_t)evt->data_len);
        break;
    default:
        break;
    }

    return capture->error;
}

static esp32_mquickjs_http_response_t *http_alloc_response(void)
{
    esp32_mquickjs_http_response_t *response;

    response = heap_caps_calloc(1, sizeof(*response), MALLOC_CAP_8BIT);
    if (response == NULL) {
        return NULL;
    }

    response->status_text = esp32_mquickjs_http_strdup("");
    if (response->status_text == NULL) {
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }

    return response;
}

esp32_mquickjs_http_response_t *esp32_mquickjs_http_perform_request(const esp32_mquickjs_http_request_t *request,
                                                                    esp32_mquickjs_http_operation_t *operation,
                                                                    esp_err_t *out_err,
                                                                    esp32_mquickjs_tls_error_t *out_tls_error,
                                                                    char *error_text,
                                                                    size_t error_text_size)
{
    esp_http_client_config_t config = {0};
    esp_http_client_handle_t client = NULL;
    esp32_mquickjs_http_capture_t capture = {0};
    esp32_mquickjs_http_response_t *response = NULL;
    esp_http_client_method_t method = HTTP_METHOD_GET;
    size_t i;
    char resolved_url[384];

    if (out_err == NULL || out_tls_error == NULL || error_text == NULL ||
        error_text_size == 0) {
        return NULL;
    }

    *out_err = ESP_OK;
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    esp32_mquickjs_tls_error_reset(out_tls_error);
#else
    memset(out_tls_error, 0, sizeof(*out_tls_error));
#endif
    error_text[0] = '\0';
    if (request == NULL || request->url == NULL || request->method == NULL) {
        *out_err = ESP_ERR_INVALID_ARG;
        snprintf(error_text, error_text_size, "invalid fetch request");
        return NULL;
    }
#if !CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (strncmp(request->url, "https://", 8) == 0) {
        *out_err = ESP_ERR_NOT_SUPPORTED;
        snprintf(error_text, error_text_size,
                 "HTTPS requires the TLS firmware capability");
        return NULL;
    }
#endif
    if (!http_method_from_string(request->method, &method)) {
        *out_err = ESP_ERR_INVALID_ARG;
        snprintf(error_text, error_text_size, "unsupported HTTP method: %s", request->method);
        return NULL;
    }

    response = http_alloc_response();
    if (response == NULL) {
        *out_err = ESP_ERR_NO_MEM;
        snprintf(error_text, error_text_size, "out of memory while allocating response");
        return NULL;
    }

    capture.response = response;
    capture.max_body_bytes = request->max_body_bytes;
    config.url = request->url;
    config.method = method;
    config.timeout_ms = (int)request->timeout_ms;
    config.event_handler = http_event_handler;
    config.user_data = &capture;
    config.user_agent = ESP32_MQUICKJS_HTTP_USER_AGENT;
    config.buffer_size = 1024;
    config.buffer_size_tx = 1024;
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    config.crt_bundle_attach = esp32_mquickjs_tls_crt_bundle_attach;
#endif
    client = esp_http_client_init(&config);
    if (client == NULL) {
        *out_err = ESP_FAIL;
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
        if (strncmp(request->url, "https://", 8) == 0) {
            esp32_mquickjs_tls_error_set(
                out_tls_error, ESP_ERR_NO_MEM, ESP_OK, 0, 0);
        }
#endif
        snprintf(error_text, error_text_size, "esp_http_client_init() failed");
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }
    if (!http_operation_attach_client(operation, client)) {
        *out_err = ESP_ERR_INVALID_STATE;
        snprintf(error_text, error_text_size, "fetch cancelled");
        http_operation_record_client_cleanup(
            operation, client, out_err, error_text, error_text_size);
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }

    for (i = 0; i < request->header_count; ++i) {
        if (esp_http_client_set_header(client,
                                       request->headers[i].key,
                                       request->headers[i].value) != ESP_OK) {
            *out_err = ESP_FAIL;
            snprintf(error_text, error_text_size, "failed to set request header: %s",
                     request->headers[i].key);
            http_operation_record_client_cleanup(
                operation, client, out_err, error_text, error_text_size);
            esp32_mquickjs_http_free_response(response);
            return NULL;
        }
    }

    if (request->body_present) {
        esp_err_t body_err;

        if (!request->body_binary &&
            !http_request_has_header(request, "Content-Type")) {
            body_err = esp_http_client_set_header(client, "Content-Type", "application/x-www-form-urlencoded");
            if (body_err != ESP_OK) {
                *out_err = body_err;
                snprintf(error_text,
                         error_text_size,
                         "failed to set default Content-Type for request body: %s",
                         esp_err_to_name(body_err));
                http_operation_record_client_cleanup(
                    operation, client, out_err, error_text, error_text_size);
                esp32_mquickjs_http_free_response(response);
                return NULL;
            }
        }

        body_err = esp_http_client_set_post_field(
            client,
            request->body_len > 0 ? (const char *)request->body : "",
            (int)request->body_len);
        if (body_err != ESP_OK) {
            *out_err = body_err;
            snprintf(error_text,
                     error_text_size,
                     "failed to set request body: %s",
                     esp_err_to_name(body_err));
            http_operation_record_client_cleanup(
                operation, client, out_err, error_text, error_text_size);
            esp32_mquickjs_http_free_response(response);
            return NULL;
        }
    }

