99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
    *out_err = esp_http_client_perform(client);
#if CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (strncmp(request->url, "https://", 8) == 0) {
        int mbedtls_error = 0;
        int verify_flags = 0;
        esp_err_t esp_tls_error =
            esp_http_client_get_and_clear_last_tls_error(
                client, &mbedtls_error, &verify_flags);

        esp32_mquickjs_tls_error_set(
            out_tls_error, *out_err, esp_tls_error, mbedtls_error,
            (uint32_t)verify_flags);
        esp32_mquickjs_tls_error_merge_verify_flags(out_tls_error);
    }
#endif
    if (esp32_mquickjs_http_operation_is_cancelled(operation)) {
        *out_err = ESP_ERR_INVALID_STATE;
        snprintf(error_text, error_text_size, "fetch cancelled");
        http_operation_record_client_cleanup(
            operation, client, out_err, error_text, error_text_size);
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }
    if (capture.error != ESP_OK) {
        *out_err = capture.error;
        if (capture.body_limit_exceeded) {
            snprintf(error_text,
                     error_text_size,
                     "HTTP response body exceeds maxBodyBytes (%u)",
                     (unsigned)request->max_body_bytes);
        } else {
            snprintf(error_text, error_text_size, "failed to capture HTTP response: %s",
                     esp_err_to_name(capture.error));
        }
        http_operation_record_client_cleanup(
            operation, client, out_err, error_text, error_text_size);
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }
    if (*out_err != ESP_OK) {
        snprintf(error_text, error_text_size, "esp_http_client_perform() failed: %s",
                 esp_err_to_name(*out_err));
        http_operation_record_client_cleanup(
            operation, client, out_err, error_text, error_text_size);
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }

    response->status = esp_http_client_get_status_code(client);
    response->ok = response->status >= 200 && response->status < 300;
    heap_caps_free(response->status_text);
    response->status_text = esp32_mquickjs_http_strdup(http_status_text(response->status));
    if (response->status_text == NULL) {
        *out_err = ESP_ERR_NO_MEM;
        snprintf(error_text, error_text_size, "out of memory while storing status text");
        http_operation_record_client_cleanup(
            operation, client, out_err, error_text, error_text_size);
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }

    if (esp_http_client_get_url(client, resolved_url, sizeof(resolved_url)) == ESP_OK) {
        response->url = esp32_mquickjs_http_strdup(resolved_url);
        if (response->url == NULL) {
            *out_err = ESP_ERR_NO_MEM;
            snprintf(error_text, error_text_size, "out of memory while storing response url");
            http_operation_record_client_cleanup(
                operation, client, out_err, error_text, error_text_size);
            esp32_mquickjs_http_free_response(response);
            return NULL;
        }
    }
    if (response->url == NULL) {
        response->url = esp32_mquickjs_http_strdup(request->url);
        if (response->url == NULL) {
            *out_err = ESP_ERR_NO_MEM;
            snprintf(error_text, error_text_size, "out of memory while storing response url");
            http_operation_record_client_cleanup(
                operation, client, out_err, error_text, error_text_size);
            esp32_mquickjs_http_free_response(response);
            return NULL;
        }
    }

    http_operation_record_client_cleanup(
        operation, client, out_err, error_text, error_text_size);
    if (*out_err != ESP_OK) {
        esp32_mquickjs_http_free_response(response);
        return NULL;
    }
    return response;
}

JSValue esp32_mquickjs_http_make_response_object(JSContext *ctx,
                                                 esp32_mquickjs_http_response_t *response)
{
    JSGCRef global_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSGCRef plain_ref;
    JSValue *global_obj;
    JSValue *headers_obj;
    JSValue *body_stream;
    JSValue *plain_headers;
    JSValue result = JS_EXCEPTION;

    global_obj = JS_PushGCRef(ctx, &global_ref);
    headers_obj = JS_PushGCRef(ctx, &headers_ref);
    body_stream = JS_PushGCRef(ctx, &body_ref);
    plain_headers = JS_PushGCRef(ctx, &plain_ref);
    *global_obj = JS_GetGlobalObject(ctx);
    *headers_obj = JS_NewObject(ctx);
    *body_stream = JS_UNDEFINED;
    *plain_headers = JS_UNDEFINED;
    if (JS_IsException(*global_obj) || JS_IsException(*headers_obj)) {
        goto done;
    }

    if (response != NULL) {
        size_t i;

        for (i = 0; i < response->header_count; ++i) {
            if (!esp32_mquickjs_set_property_ref(ctx,
                                             headers_obj,
                                             response->headers[i].key,
                                             JS_NewString(ctx, response->headers[i].value))) {
                goto done;
            }
        }
    }

    {
        uint8_t *body = response != NULL ? response->body : NULL;
        size_t body_len = response != NULL ? response->body_len : 0;

        if (response != NULL) {
            response->body = NULL;
            response->body_len = 0;
        }
        *body_stream = esp32_mquickjs_stream_open_memory_owned_binary(
            ctx, *global_obj, body, body_len);
    }
    if (JS_IsException(*body_stream)) {
        goto done;
    }

    *plain_headers = esp32_mquickjs_make_headers_object(ctx, *global_obj, *headers_obj);
    if (JS_IsException(*plain_headers)) {
        goto done;
    }

    result = esp32_mquickjs_make_response_object(ctx,
                                                 *global_obj,
                                                 response != NULL ? response->status : 200,
                                                 response != NULL ? response->status_text : "OK",
                                                 response != NULL ? response->url : "",
                                                 *plain_headers,
                                                 *body_stream);

done:
    JS_PopGCRef(ctx, &plain_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

