99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
static int http_parse_timeout(JSContext *ctx,
                              JSValue value,
                              uint32_t *out_timeout_ms)
{
    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        *out_timeout_ms = ESP32_MQUICKJS_HTTP_DEFAULT_TIMEOUT_MS;
        return 0;
    }
    if (!esp32_mquickjs_value_to_bounded_u32(
            ctx, value, 0, INT32_MAX, out_timeout_ms)) {
        return -1;
    }
    return 0;
}

static int http_parse_max_body_bytes(JSContext *ctx,
                                     JSValue value,
                                     size_t *out_max_body_bytes)
{
    int max_body_bytes = 0;

    if (JS_IsUndefined(value) || JS_IsNull(value)) {
        *out_max_body_bytes = CONFIG_ESP32_MQUICKJS_HTTP_MAX_RESPONSE_BODY_BYTES;
        return 0;
    }
    if (JS_ToInt32(ctx, &max_body_bytes, value) != 0 || max_body_bytes <= 0) {
        return -1;
    }

    *out_max_body_bytes = (size_t)max_body_bytes;
    return 0;
}

static int http_parse_headers(JSContext *ctx,
                              JSValue *headers_value,
                              esp32_mquickjs_http_header_t **out_headers,
                              size_t *out_header_count)
{
    JSGCRef keys_array_ref;
    JSGCRef length_ref;
    JSValue *keys_array;
    JSValue *length_value;
    esp32_mquickjs_http_header_t *headers = NULL;
    int length = 0;
    int header_count = 0;
    int i;
    int result = -1;

    if (JS_IsUndefined(*headers_value) || JS_IsNull(*headers_value)) {
        *out_headers = NULL;
        *out_header_count = 0;
        return 0;
    }
    if (esp32_mquickjs_is_headers_object(ctx, *headers_value)) {
        *headers_value = esp32_mquickjs_headers_to_plain_object(ctx, *headers_value);
        if (JS_IsException(*headers_value)) {
            return -1;
        }
    }

    keys_array = JS_PushGCRef(ctx, &keys_array_ref);
    length_value = JS_PushGCRef(ctx, &length_ref);

    *keys_array = JS_UNDEFINED;
    *length_value = JS_UNDEFINED;

    if (JS_GetClassID(ctx, *headers_value) != JS_CLASS_OBJECT) {
        JS_ThrowTypeError(
            ctx, "fetch(url, options) expects options.headers to be a plain object");
        goto done;
    }
    *keys_array = esp32_mquickjs_own_property_keys(ctx, *headers_value);
    if (JS_IsException(*keys_array)) {
        goto done;
    }

    *length_value = JS_GetPropertyStr(ctx, *keys_array, "length");
    if (JS_IsException(*length_value) || JS_ToInt32(ctx, &length, *length_value) != 0 || length < 0) {
        JS_ThrowTypeError(ctx, "fetch(url, options.headers) expects a plain object");
        goto done;
    }

    if (length > ESP32_MQUICKJS_HTTP_MAX_REQUEST_HEADERS) {
        length = ESP32_MQUICKJS_HTTP_MAX_REQUEST_HEADERS;
    }

    if (length > 0) {
        headers = heap_caps_calloc((size_t)length, sizeof(*headers), MALLOC_CAP_8BIT);
        if (headers == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
    }

    for (i = 0; i < length; ++i) {
        JSGCRef key_ref;
        JSGCRef value_ref;
        JSValue *key_value;
        JSValue *value_value;
        JSCStringBuf key_buf;
        JSCStringBuf value_buf;
        const char *key;
        const char *value;
        char *key_copy;

        key_value = JS_PushGCRef(ctx, &key_ref);
        value_value = JS_PushGCRef(ctx, &value_ref);
        *key_value = JS_GetPropertyUint32(ctx, *keys_array, (uint32_t)i);
        *value_value = JS_UNDEFINED;
        if (JS_IsException(*key_value)) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }

        key = JS_ToCString(ctx, *key_value, &key_buf);
        if (key == NULL) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }
        key_copy = esp32_mquickjs_http_strdup(key);
        if (key_copy == NULL) {
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }

        *value_value = JS_GetPropertyStr(ctx, *headers_value, key_copy);
        if (JS_IsException(*value_value)) {
            heap_caps_free(key_copy);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }

        value = JS_ToCString(ctx, *value_value, &value_buf);
        if (value == NULL) {
            heap_caps_free(key_copy);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }

        headers[header_count].value = esp32_mquickjs_http_strdup(value);
        if (headers[header_count].value == NULL) {
            heap_caps_free(key_copy);
            JS_PopGCRef(ctx, &value_ref);
            JS_PopGCRef(ctx, &key_ref);
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
        headers[header_count].key = key_copy;
        header_count++;
        JS_PopGCRef(ctx, &value_ref);
        JS_PopGCRef(ctx, &key_ref);
    }

    *out_headers = headers;
    *out_header_count = (size_t)header_count;
    headers = NULL;
    result = 0;

done:
    esp32_mquickjs_http_free_headers(headers, (size_t)header_count);
    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_array_ref);
    return result;
}

static int http_parse_options(JSContext *ctx,
                              JSValue *options_value,
                              esp32_mquickjs_http_request_t *request)
{
    JSGCRef method_ref;
    JSGCRef body_ref;
    JSGCRef timeout_ref;
    JSGCRef max_body_ref;
    JSGCRef headers_ref;
    JSValue *method_value;
    JSValue *body_value;
    JSValue *timeout_value;
    JSValue *max_body_value;
    JSValue *headers_value;
    JSCStringBuf method_buf;
    const char *method;

    if (JS_IsUndefined(*options_value) || JS_IsNull(*options_value)) {
        return 0;
    }
    if (JS_IsString(ctx, *options_value) || JS_IsBool(*options_value) || JS_IsFunction(ctx, *options_value)) {
        JS_ThrowTypeError(ctx, "fetch(url, options) expects options to be an object");
        return -1;
    }

    method_value = JS_PushGCRef(ctx, &method_ref);
    body_value = JS_PushGCRef(ctx, &body_ref);
    timeout_value = JS_PushGCRef(ctx, &timeout_ref);
    max_body_value = JS_PushGCRef(ctx, &max_body_ref);
    headers_value = JS_PushGCRef(ctx, &headers_ref);
    *method_value = JS_GetPropertyStr(ctx, *options_value, "method");
    *body_value = JS_GetPropertyStr(ctx, *options_value, "body");
    *timeout_value = JS_GetPropertyStr(ctx, *options_value, "timeoutMs");
    *max_body_value = JS_GetPropertyStr(ctx, *options_value, "maxBodyBytes");
    *headers_value = JS_GetPropertyStr(ctx, *options_value, "headers");

