99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
    if (JS_IsException(*method_value) || JS_IsException(*body_value) ||
        JS_IsException(*timeout_value) || JS_IsException(*max_body_value) ||
        JS_IsException(*headers_value)) {
        goto fail;
    }

    if (!JS_IsUndefined(*method_value) && !JS_IsNull(*method_value)) {
        if (!JS_IsString(ctx, *method_value)) {
            JS_ThrowTypeError(ctx, "fetch(url, options.method) expects a string");
            goto fail;
        }

        method = JS_ToCString(ctx, *method_value, &method_buf);
        if (method == NULL) {
            goto fail;
        }
        heap_caps_free(request->method);
        request->method = esp32_mquickjs_http_strdup(method);
        if (request->method == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
    }

    if (http_materialize_body(ctx, *body_value,
                              "fetch(url, options.body)", request) != 0) {
        goto fail;
    }

    if (http_parse_timeout(ctx, *timeout_value, &request->timeout_ms) != 0) {
        JS_ThrowTypeError(ctx, "fetch(url, options.timeoutMs) expects a non-negative integer");
        goto fail;
    }

    if (http_parse_max_body_bytes(ctx, *max_body_value, &request->max_body_bytes) != 0) {
        JS_ThrowTypeError(ctx, "fetch(url, options.maxBodyBytes) expects a positive integer");
        goto fail;
    }

    if (http_parse_headers(ctx, headers_value, &request->headers, &request->header_count) != 0) {
        goto fail;
    }
    if (http_validate_content_length(ctx, request) != 0) {
        goto fail;
    }

    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &max_body_ref);
    JS_PopGCRef(ctx, &timeout_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &method_ref);
    return 0;

fail:
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &max_body_ref);
    JS_PopGCRef(ctx, &timeout_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &method_ref);
    return -1;
}

static int http_parse_request_object(JSContext *ctx,
                                     JSValue *request_value,
                                     esp32_mquickjs_http_request_t *request)
{
    JSGCRef method_ref;
    JSGCRef url_ref;
    JSGCRef headers_ref;
    JSGCRef body_ref;
    JSGCRef timeout_ref;
    JSGCRef max_body_ref;
    JSValue *method_value;
    JSValue *url_value;
    JSValue *headers_value;
    JSValue *body_value;
    JSValue *timeout_value;
    JSValue *max_body_value;
    JSCStringBuf method_buf;
    JSCStringBuf url_buf;
    const char *method;
    const char *url;

    method_value = JS_PushGCRef(ctx, &method_ref);
    url_value = JS_PushGCRef(ctx, &url_ref);
    headers_value = JS_PushGCRef(ctx, &headers_ref);
    body_value = JS_PushGCRef(ctx, &body_ref);
    timeout_value = JS_PushGCRef(ctx, &timeout_ref);
    max_body_value = JS_PushGCRef(ctx, &max_body_ref);
    *method_value = JS_GetPropertyStr(ctx, *request_value, "method");
    *url_value = JS_GetPropertyStr(ctx, *request_value, "url");
    *headers_value = JS_GetPropertyStr(ctx, *request_value, "headers");
    *body_value = JS_GetPropertyStr(ctx, *request_value, "body");
    *timeout_value = JS_GetPropertyStr(ctx, *request_value, "timeoutMs");
    *max_body_value = JS_GetPropertyStr(ctx, *request_value, "maxBodyBytes");

    if (JS_IsException(*method_value) || JS_IsException(*url_value) || JS_IsException(*headers_value) ||
        JS_IsException(*body_value) || JS_IsException(*timeout_value) || JS_IsException(*max_body_value)) {
        goto fail;
    }
    if (!JS_IsString(ctx, *method_value) || !JS_IsString(ctx, *url_value)) {
        JS_ThrowTypeError(ctx, "fetch(request) expects Request.method and Request.url");
        goto fail;
    }

    method = JS_ToCString(ctx, *method_value, &method_buf);
    if (method == NULL) {
        goto fail;
    }
    request->method = esp32_mquickjs_http_strdup(method);
    if (request->method == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }

    url = JS_ToCString(ctx, *url_value, &url_buf);
    if (url == NULL) {
        goto fail;
    }
#if !CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (strncmp(url, "https://", 8) == 0) {
        JS_ThrowTypeError(ctx, "HTTPS requires the TLS firmware capability");
        goto fail;
    }
#endif
    request->url = esp32_mquickjs_http_strdup(url);
    request->timeout_ms = ESP32_MQUICKJS_HTTP_DEFAULT_TIMEOUT_MS;
    request->max_body_bytes = CONFIG_ESP32_MQUICKJS_HTTP_MAX_RESPONSE_BODY_BYTES;
    if (request->url == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }

    if (http_parse_timeout(ctx, *timeout_value, &request->timeout_ms) != 0) {
        JS_ThrowTypeError(ctx, "fetch(request) expects Request.timeoutMs to be a non-negative integer");
        goto fail;
    }
    if (http_parse_max_body_bytes(ctx, *max_body_value, &request->max_body_bytes) != 0) {
        JS_ThrowTypeError(ctx, "fetch(request) expects Request.maxBodyBytes to be a positive integer");
        goto fail;
    }
    if (http_parse_headers(ctx, headers_value, &request->headers, &request->header_count) != 0) {
        goto fail;
    }
    if (http_materialize_body(ctx, *body_value, "fetch(request.body)",
                              request) != 0) {
        goto fail;
    }
    if (http_validate_content_length(ctx, request) != 0) {
        goto fail;
    }

    JS_PopGCRef(ctx, &max_body_ref);
    JS_PopGCRef(ctx, &timeout_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &url_ref);
    JS_PopGCRef(ctx, &method_ref);
    return 0;

fail:
    JS_PopGCRef(ctx, &max_body_ref);
    JS_PopGCRef(ctx, &timeout_ref);
    JS_PopGCRef(ctx, &body_ref);
    JS_PopGCRef(ctx, &headers_ref);
    JS_PopGCRef(ctx, &url_ref);
    JS_PopGCRef(ctx, &method_ref);
    return -1;
}

int esp32_mquickjs_http_build_request_from_args(JSContext *ctx,
                                                int argc,
                                                JSGCRef *argv,
                                                esp32_mquickjs_http_request_t *request)
{
    JSCStringBuf url_buf;
    const char *url;

    if (argc < 1 || argc > 2) {
        JS_ThrowTypeError(ctx, "fetch(input, options?) expects a URL string or Request");
        return -1;
    }

    if (argc >= 2) {
        if (JS_IsFunction(ctx, argv[1].val)) {
            JS_ThrowTypeError(ctx,
                              "fetch(input, options?) does not accept a callback; use Future.call(fetch, globalThis, args)");
            return -1;
        }
    }

    if (esp32_mquickjs_is_request_object(ctx, argv[0].val)) {
        if (argc >= 2 && !JS_IsUndefined(argv[1].val) && !JS_IsNull(argv[1].val)) {
            JS_ThrowTypeError(ctx, "fetch(request) does not accept a separate options object");
            return -1;
        }
        return http_parse_request_object(ctx, &argv[0].val, request);
    }

    if (!JS_IsString(ctx, argv[0].val)) {
        JS_ThrowTypeError(ctx, "fetch(input, options?) expects a URL string or Request");
        return -1;
    }

