99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/http/esp32_mquickjs_http.c
    url = JS_ToCString(ctx, argv[0].val, &url_buf);
    if (url == NULL) {
        return -1;
    }
#if !CONFIG_ESP32_MQUICKJS_FEATURE_TLS
    if (strncmp(url, "https://", 8) == 0) {
        JS_ThrowTypeError(ctx, "HTTPS requires the TLS firmware capability");
        return -1;
    }
#endif

    request->url = esp32_mquickjs_http_strdup(url);
    request->method = esp32_mquickjs_http_strdup("GET");
    request->timeout_ms = ESP32_MQUICKJS_HTTP_DEFAULT_TIMEOUT_MS;
    request->max_body_bytes = CONFIG_ESP32_MQUICKJS_HTTP_MAX_RESPONSE_BODY_BYTES;
    if (request->url == NULL || request->method == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return -1;
    }

    return argc >= 2 ? http_parse_options(ctx, &argv[1].val, request) : 0;
}

bool esp32_mquickjs_init_http_runtime(JSContext *ctx,
                                      esp32_mquickjs_runtime_t *runtime)
{
    return esp32_mquickjs_init_http_future_runtime(ctx, runtime);
}

JSValue js_http_get_default_timeout_ms(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, ESP32_MQUICKJS_HTTP_DEFAULT_TIMEOUT_MS);
}

JSValue js_http_get_max_body_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewUint32(ctx, CONFIG_ESP32_MQUICKJS_HTTP_MAX_RESPONSE_BODY_BYTES);
}

JSValue js_http_fetch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef global_ref;
    JSGCRef http_ref;
    JSGCRef fetch_ref;
    JSValue *global;
    JSValue *http;
    JSValue *fetch;
    JSValue result;

    (void)this_val;
    global = JS_PushGCRef(ctx, &global_ref);
    http = JS_PushGCRef(ctx, &http_ref);
    fetch = JS_PushGCRef(ctx, &fetch_ref);
    *global = JS_GetGlobalObject(ctx);
    *http = JS_GetPropertyStr(ctx, *global, "http");
    *fetch = JS_IsException(*http)
                 ? JS_EXCEPTION
                 : JS_GetPropertyStr(ctx, *http, "fetch");
    if (JS_IsException(*global) || JS_IsException(*http) ||
        JS_IsException(*fetch)) {
        result = JS_EXCEPTION;
    } else {
        result = esp32_mquickjs_future_call_and_wait(ctx,
                                                     esp32_mquickjs_get_active_runtime(),
                                                     *fetch,
                                                     *http,
                                                     argc,
                                                     argv);
    }
    JS_PopGCRef(ctx, &fetch_ref);
    JS_PopGCRef(ctx, &http_ref);
    JS_PopGCRef(ctx, &global_ref);
    return result;
}

#endif
